// 'use client';
import './privacyPolicy.css';

export default async function PrivacyPolicy() {
  return (
    <main>
      <h2>Політика конфіденційності</h2>
      <p>
        Справжній документ «Політика конфіденційності» (далі - за текстом - «Політика»)
        являє собою правила використання ТОВ "Кафе "Ярославське", персональної інформації
        користувача
      </p>
      <ol>
        <li>
          Загальні положення
          <ol>
            <li>
              Справжня Політика конфіденційності є невід'ємною частиною Користувацької
              угоди (далі - «Угода»), розміщеної за адресою:
              https://yaroslavskiy.kh.ua/assortment/ua/privacyPolicy, а також інших
              Договорів, що укладаються між Сторонами.
            </li>
            <li>
              Укладаючи Власну Угоду Користувач вільно, своєю волею і в своїх інтересах
              даєте безстрокову письмову згоду на будь-які способи обробки своїх
              персональних даних, включаючи будь-яку дію (операцію) або сукупність дій
              (операцій), що здійснюються з використанням засобів автоматизації або без
              використання таких коштів з персональними даними, у тому числі збір, запис,
              систематизацію, накопичення, зберігання, уточнення (оновлення, зміна),
              вилучення, використання, передачу (поширення, надання, доступ),
              знеособлення, блокування, видалення, знищення персональних даних у
              встановлених справжньою Політикою цілях.
            </li>
            <li>
              У цій Політиці конфіденційності використовуються терміни і визначення,
              передбачені Користувальницькою Угодою, а також іншими договорами, що
              укладаються з Користувачем, якщо інше не передбачено справжньою Політикою
              або не випливає з її істоти. В інших випадках тлумачення застосовуваного в
              Політиці терміна проводиться відповідно до чинного законодавства України.
            </li>
          </ol>
        </li>
        <li>
          Особиста інформація
          <ol>
            <li>
              Під персональною інформацією в справжній Політиці розуміється:
              <ol>
                <li>
                  Інформація, яку користувач надає про себе самостійно при реєстрації на
                  Сайті, а також у процесі подальшого використання Сервісів Сайту,
                  включаючи персональні дані Користувача. Користувач надаємо самостійно
                  такі персональні дані: Прізвище, Ім'я, По Батькові, контактний номер
                  телефону, адреса електронної пошти, адреса доставки Товару.
                </li>
                <li>
                  Дані, які передаються в автоматичному режимі залежно від параметрів
                  програмного забезпечення Користувача, включаючи, але не обмежуючись:
                  IP-адреса, cookie, дані про використовуване користувачем програмне
                  забезпечення та обладнання для роботи в мережі зв'язку, включаючи
                  Інтернет, параметрах і налаштуваннях інтернет-браузерів, що передається
                  і отримується з використанням Сайту інформації.
                </li>
              </ol>
            </li>
            <li>
              Користувач усвідомлює та приймає можливість розміщення на сторінках Сайту
              програмного забезпечення третіх осіб, внаслідок чого такі особи можуть
              отримувати зазначені у п.2.1.2 знеособлені дані. До зазначеного програмного
              забезпечення третіх осіб серед іншого можуть відноситися:
              <ul>
                <li>
                  системи зі збору статистики відвідувань (наприклад, метрики Google
                  Analytics тощо);
                </li>
                <li>
                  соціальні плагіни (блоки) соціальних мереж (наприклад, Facebook тощо);
                </li>
                <li>інші системи збору знеособленої інформації.</li>
              </ul>
              Користувач має право самостійно обмежити збір такої інформації третіми
              особами, використовуючи стандартні налаштування конфіденційності
              застосовуваного ним для роботи з Сайтом інтернет-браузера.
            </li>
            <li>
              Продавець має право встановлювати вимоги до складу Персональної інформації
              Користувача, яка повинна обов'язково надаватися для використання Сайту і
              Сервісів, що надається ним. Якщо певна інформація не позначена Продавцем як
              обов'язкова, її надання здійснюється користувачем на власний розсуд.
            </li>
            <li>
              Продавець не здійснює перевірку достовірності наданої Персональної
              інформації, вважаючи, що Користувач діє сумлінно і докладає всіх необхідних
              зусиль до підтримки такої інформації в актуальному стані.
            </li>
          </ol>
        </li>
        <li>
          Цілі обробки Персональної інформації
          <ol>
            <li>
              {' '}
              Продавець здійснює обробку, в тому числі збір та зберігання лише тієї
              Персональної інформації, яка необхідна для укладення та виконання договорів
              з Користувачем
            </li>
            <li>
              Продавець має право використовувати Персональну інформацію зокрема в таких
              цілях:
              <ul>
                <li>Укладання договорів на використання Сайту і Сервісів Сайту;</li>
                <li>
                  Виконання зобов'язань за укладеними договорами, включаючи надання
                  користувачеві доступу до Сайту і його Сервісів;
                </li>
                <li>
                  Ідентифікація користувача в рамках виконання зобов'язань за укладеними з
                  ним договорами, включаючи виконання Замовлень Покупців;
                </li>
                <li>
                  Проведення опитувань, контролю задоволеності користувача Сайту про
                  якість послуг, що надаються Продавцем;
                </li>
                <li>
                  Інформування Користувача про акції та пропозиції Продавця, в тому числі
                  рекламні повідомлення, на електронну пошту та мобільний телефон
                  Користувача за його згодою;
                </li>
                <li>
                  Забезпечення зв'язку з користувачем з метою інформаційного
                  обслуговування та поліпшення якості Сервісу Сайту, в тому числі в
                  порядку нотифікації із залученням третіх осіб;
                </li>
                <li>Надання послуг з клієнтської підтримки користувачів;</li>
                <li>
                  Використання знеособлених даних для таргетингу рекламних та/або
                  інформаційних матеріалів за віком, статтю, іншими ознаками;
                </li>
                <li>
                  Проведення маркетингових, статистичних та інших досліджень на основі
                  знеособлених даних.
                </li>
              </ul>
            </li>
          </ol>
        </li>
        <li>
          Вимоги до захисту Персональної інформації
          <ol>
            <li>
              Продавець здійснює зберігання Персональної інформації та забезпечує її
              охорону від несанкціонованого доступу та розповсюдження відповідно до
              внутрішніх правил і регламентів.
            </li>
            <li>
              Щодо Персональної інформації користувача зберігається її конфіденційність,
              за винятком випадків, коли технологія Сайта або його Сервісів або
              налаштування використовуваного користувачем програмного забезпечення
              передбачають відкритий обмін інформацією з будь-якими користувачами мережі
              Інтернет.
            </li>
            <li>
              Продавець має право передавати Персональну інформацію третім особам у таких
              випадках:
              <ul>
                <li>
                  Користувач висловив свою згоду на такі дії, включаючи випадки
                  застосування користувачем налаштувань використовуваного програмного
                  забезпечення, що не обмежують надання певної інформації;
                </li>
                <li>
                  Передача необхідна в рамках використання користувачем функціональних
                  можливостей Сайта або його Сервісів;
                </li>
                <li>
                  За запитом суду або іншого уповноваженого державного органу в рамках
                  встановленої законодавством процедури;
                </li>
                <li>
                  Для захисту прав і законних інтересів Продавця у зв'язку з порушенням
                  укладених з користувачем договорів.
                </li>
              </ul>
            </li>
          </ol>
        </li>
        <li>
          Зміна Особистої інформації
          <ol>
            <li>
              Користувач має право в будь-який момент самостійно відредагувати у своєму
              Особистому кабінеті надану ним при реєстрації Персональну інформацію.
            </li>
            <li>
              У разі припинення укладеного договору, користувач реалізувати право на
              відкликання згоди на обробку його персональних даних та видалення Облікового
              запису Користувача шляхом направлення Продавцю запиту на видалення свого
              облікового запису за адресою gevo.ham@ukr.net,
            </li>
            <li>
              З метою підвищення якості Сайту та його Сервісів і забезпечення можливості
              правового захисту, Продавець має право зберігати лог-файли про дії, вчинені
              користувачем в рамках використання Сайту і його Сервісів, а також у зв'язку
              з укладенням і виконанням Користувачем Угоди та інших договорів зі свого
              боку, протягом 6 (Шести) місяців з моменту їх вчинення.
            </li>
          </ol>
        </li>
        <li>
          Зміна Політики конфіденційності
          <ol>
            <li>
              Справжня Політика може бути змінена Продавцем в односторонньому порядку без
              попереднього повідомлення Користувача. Нова редакція Політики набирає
              чинності з моменту її розміщення на Сайті Продавця, якщо інше не передбачено
              новою редакцією Політики.
            </li>
            <li>
              Чинна редакція Політики знаходиться на Сайті Продавця за адресою
              https://yaroslavskiy.kh.ua/assortment/ua/privacyPolicy/
            </li>
          </ol>
        </li>
      </ol>
    </main>
  );
}
