// 'use client';
import { css, cx } from '../../../../styled-system/css';
import { stack } from '../../../../styled-system/recipes';
import './privacyPolicy.css';

export default async function PrivacyPolicy() {
  return (
    <main>
      <h2>Політика щодо обробки персональних даних</h2>

      <ol>
        <li>
          Загальні положення Ця політика обробки персональних даних складена відповідно до
          вимог Федерального закону від 27.07.2006 №152-ФЗ «Про персональні дані» і
          визначає порядок обробки персональних даних та заходи щодо забезпечення безпеки
          персональних даних, що вживаються Рестораном Ярославським (далі – Оператор).
          <ol>
            <li>
              Оператор ставить своєю найважливішою метою і умовою здійснення своєї
              діяльності дотримання прав і свобод людини і громадянина під час обробки
              його персональних даних, зокрема захист прав на недоторканність приватного
              життя, особисту і сімейну таємницю.
            </li>
            <li>
              Ця політика Оператора щодо обробки персональних даних (далі – Політика)
              застосовується до всієї інформації, яку Оператор може отримати про
              відвідувачів веб-сайту https://yaroslavskiy.kh.ua.
            </li>
          </ol>
        </li>
        <li>
          Основні поняття, що використовуються в Політиці
          <ol>
            <li>
              Автоматизована обробка персональних даних – обробка персональних даних за
              допомогою засобів обчислювальної техніки;
            </li>
            <li>
              Блокування персональних даних – тимчасове припинення обробки персональних
              даних (за винятком випадків, якщо обробка необхідна для уточнення
              персональних даних);
            </li>
            <li>
              Веб-сайт – сукупність графічних та інформаційних матеріалів, а також програм
              для ЕОМ і баз даних, що забезпечують їх доступність в мережі Інтернет за
              мережевою адресою https://yaroslavskiy.kh.ua;
            </li>
            <li>
              Інформаційна система персональних даних — сукупність, що міститься в базах
              даних персональних даних, і забезпечуючих їх обробку інформаційних
              технологій та технічних засобів;
            </li>
            <li>
              Обезличення персональних даних — дії, в результаті яких неможливо визначити
              без використання додаткової інформації приналежність персональних даних
              конкретному Користувачу або іншому суб'єкту персональних даних;
            </li>
            <li>
              Обробка персональних даних – будь-яка дія (операція) або сукупність дій
              (операцій), що здійснюються з використанням засобів автоматизації або без
              використання таких засобів з персональними даними, включаючи збір, запис,
              систематизацію, накопичення, зберігання, уточнення (оновлення, зміна),
              вилучення, використання, передачу (розповсюдження, надання, доступ),
              обезличення, блокування, видалення, знищення персональних даних;{' '}
            </li>
            <li>
              Оператор – державний орган, муніципальний орган, юридична або фізична особа,
              самостійно або спільно з іншими особами організуючі і (або) здійснюючі
              обробку персональних даних, а також визначаючі цілі обробки персональних
              даних, склад персональних даних, що підлягають обробці, дії (операції), що
              здійснюються з персональними даними;
            </li>
            <li>
              Персональні дані – будь-яка інформація, що стосується прямо або побічно
              певного або визначеного Користувача веб-сайту https://yaroslavskiy.kh.ua;
            </li>
            <li>
              Користувач – будь-який відвідувач веб-сайту https://yaroslavskiy.kh.ua;
            </li>
            <li>
              Надання персональних даних – дії, спрямовані на розкриття персональних даних
              певній особі або певному колу осіб;
            </li>
            <li>
              Розповсюдження персональних даних – будь-які дії, спрямовані на розкриття
              персональних даних невизначеному колу осіб (передача персональних даних) або
              на ознайомлення з персональними даними необмеженого кола осіб, включаючи
              оприлюднення персональних даних у засобах масової інформації, розміщення в
              інформаційно-телекомунікаційних мережах або надання доступу до персональних
              даних якимось іншим способом;
            </li>
            <li>
              Трансгранична передача персональних даних – передача персональних даних на
              територію іноземної держави органу влади іноземної держави, іноземній
              фізичній або юридичній особі;
            </li>
            <li>
              Знищення персональних даних – будь-які дії, в результаті яких персональні
              дані знищуються безповоротно з неможливістю подальшого відновлення змісту
              персональних даних в інформаційній системі персональних даних і (або)
              знищуються матеріальні носії персональних даних.
            </li>
          </ol>
        </li>
        <li>
          Оператор може обробляти наступні персональні дані Користувача
          <ol>
            <li> Прізвище, ім'я, по батькові;</li>
            <li> Електронна адреса;</li>
            <li> Номери телефонів;</li>
            <li>
              {' '}
              Також на сайті відбувається збір та обробка анонімних даних про відвідувачів
              (в т.ч. файлів «cookie») за допомогою сервісів інтернет-статистики (Яндекс
              Метрика, Гугл Аналітика та інших).
            </li>
            <li>
              {' '}
              Вищезазначені дані далі по тексту Політики об'єднані загальним поняттям
              Персональні дані.
            </li>
          </ol>
        </li>
        <li>
          Цілі обробки персональних даних
          <ol>
            <li>
              Мета обробки персональних даних Користувача — інформування Користувача
              шляхом надсилання електронних листів; надання доступу Користувачу до
              сервісів, інформації та/або матеріалів, що містяться на веб-сайті.
            </li>
            <li>
              Також Оператор має право надсилати Користувачу повідомлення про нові
              продукти та послуги, спеціальні пропозиції та різні події. Користувач завжди
              може відмовитися від отримання інформаційних повідомлень, надіславши
              Оператору листа на електронну адресу dostavkayaroslav@gmail.com з поміткою
              «Відмова від сповіщень про нові продукти та послуги і спеціальні
              пропозиції».
            </li>
            <li>
              Анонімні дані Користувачів, що збираються за допомогою сервісів
              інтернет-статистики, слугують для збору інформації про дії Користувачів на
              сайті, покращення якості сайту та його змісту.
            </li>
          </ol>
        </li>
        <li>
          Правові підстави для обробки персональних даних
          <ol>
            <li>
              Оператор обробляє персональні дані Користувача тільки у випадку їх
              заповнення та/або надсилання Користувачем самостійно через спеціальні форми,
              розташовані на сайті https://yaroslavskiy.kh.ua. Заповнюючи відповідні форми
              та/або надсилаючи свої персональні дані Оператору, Користувач висловлює свою
              згоду з цією Політикою.
            </li>
            <li>
              {' '}
              Оператор обробляє анонімні дані про Користувача у випадку, якщо це дозволено
              в налаштуваннях браузера Користувача (включено збереження файлів «cookie» і
              використання технології JavaScript).
            </li>
          </ol>
        </li>

        <li>
          Порядок збору, зберігання, передачі та інших видів обробки персональних даних.
          Безпека персональних даних, які обробляються Оператором, забезпечується шляхом
          реалізації правових, організаційних і технічних заходів, необхідних для
          виконання в повному обсязі вимог чинного законодавства в сфері захисту
          персональних даних.
          <ol>
            <li>
              Оператор забезпечує збереження персональних даних і приймає всі можливі
              заходи, що виключають доступ до персональних даних неуповноважених осіб.
            </li>
            <li>
              Персональні дані Користувача ніколи, ні за яких умов не будуть передані
              третім особам, за винятком випадків, пов'язаних із виконанням чинного
              законодавства.
            </li>
            <li>
              У разі виявлення неточностей у персональних даних Користувач може
              актуалізувати їх самостійно, шляхом направлення Оператору повідомлення на
              електронну адресу Оператора dostavkayaroslav@gmail.com з поміткою
              «Актуалізація персональних даних».
            </li>
            <li>
              Термін обробки персональних даних є необмеженим. Користувач може в будь-який
              момент відкликати свою згоду на обробку персональних даних, надіславши
              Оператору повідомлення електронною поштою на електронну адресу Оператора
              dostavkayaroslav@gmail.com з поміткою «Відкликання згоди на обробку
              персональних даних».
            </li>
          </ol>
        </li>
        <li>
          Трансгранична передача персональних даних
          <ol>
            <li>
              Оператор перед початком здійснення трансграничної передачі персональних
              даних зобов'язаний переконатися в тому, що іноземною державою, на територію
              якої передбачено здійснення передачі персональних даних, забезпечується
              надійний захист прав суб'єктів персональних даних.
            </li>
            <li>
              Трансгранична передача персональних даних на території іноземних держав, які
              не відповідають вищезазначеним вимогам, може здійснюватися тільки у разі
              наявності згоди в письмовій формі суб'єкта персональних даних на
              трансграничну передачу його персональних даних та/або виконання договору,
              стороною якого є суб'єкт персональних даних.
            </li>
          </ol>
        </li>

        <li>
          Заключні положення
          <ol>
            <li>
              Користувач може отримати будь-які роз'яснення з питань, що його цікавлять,
              стосовно обробки його персональних даних, звернувшись до Оператора за
              допомогою електронної пошти dostavkayaroslav@gmail.com.
            </li>
            <li>
              У цьому документі будуть відображені будь-які зміни політики обробки
              персональних даних Оператором. Політика діє безстроково до заміни її новою
              версією.
            </li>
            <li>
              Актуальна версія Політики у вільному доступі розташована в мережі Інтернет
              за адресою: https://yaroslavskiy.kh.ua/assortment/ua/privacyPolicy/.
            </li>
          </ol>
        </li>
      </ol>
    </main>
  );
}
